{
  "i18n":{
    "router": {
      "resume": "Resume",
      "contact": "Contact"
    },
    "language": {
      "en": "English",
      "tw": "繁體中文"
    },
    "resume": {
      "about": "About",
      "education": "Education",
      "skills": "Skills",
      "experience": "Experience",
      "portfolio": "Portfolio",
      "achievements": "Achievements",
      "hobbits": "Hobbits"
    },
    "about": {
      "location": "Taipei, Taiwan",
      "welcomeTitle": "Welcome to my website!",
      "name": "Jasper Li",
      "jobTitle": "Full Stack Web Developer",
      "introdueContent": "Hello everyone, my name is Jasper Li. As a web developer with two years of experience, I specialize in RWD (Responsive Web Design) and UI/UX design. I am also skilled in creating databases and integrating backend data using APIs. I am passionate about creating visually appealing and user-friendly websites. Let's work together to create stunning projects!"
    },
    "education": {
      "title": "Education",
      "klsh": "National Keelung Senior High School",
      "cjcu": "Chang Jung Christian University",
      "nkust": "National Kaohsiung University of Science and Technology",
      "degreeOfKLSH": "General High School Program",
      "degreeOfCJCU": "Bachelor's Degree in Information Management.",
      "degreeOfNKUST": "Master's Degree in Computer and Communication Engineering.",
      "contentOfKLSH": "",
      "contentOfCJCU": "During my studies, I took courses in database design, algorithms, data structures, and mobile app development. I am interested in app development, and for my graduation project, I used Java to develop a Gomoku game Android app.\n\nStarting from my junior year, I spend a lot of time on the ITSA college programming competitions, where I honed my problem-solving skills and gradually became proficient in basic programming syntax.",
      "contentOfNKUST": "When I was in my first year of master's degree, I won the Hackathon's Best Market Award for an app that detects road surface bumpy.\n\nWhen I was in the second year of my master's degree, I worked part-time as an Android App engineer in an electronics company. My work included UI interface development and Bluetooth connection to receive data.\n\nBefore graduation, I decided to become a website back-end development engineer as a career."
    },
    "skill": {
      "title": "Skill",
      "frontend": "Front-End Web Development",
      "frontendContent": "Able to code in VueJS, AngularJS, TypeScript and JavaScript.",
      "backend": "Back-End Web Development",
      "backendContent": "Able to code in Java, used Spring Boot to build Web API, create a database and set up data fields.",
      "rwd": "Responsive Layouts",
      "rwdContent": "Design adaptive layouts for different devices, giving users the best browsing experience.",
      "app": "Mobile App",
      "appContent": "Native Android app Development.",
      "gui": "Graphical user interface(GUI)",
      "guiContent": "Develop object recognition system using Tkinter and Python.",
      "develop": "Development Tools",
      "developContent": "Use Android Studio to develop Android apps, Eclipse with Spring Boot to develop web back-end, and currently mainly use VS Code with Vue3 to develop web front-end.",
      "versionControl": "Version Control",
      "versionControlContent": "Using GitLab and Git to collaborate with the team."
    },
    "experience": {
      "title": "工作經歷",
      "company1": "歐格電子",
      "jobTitleOfCompany1": "Android app工程師",
      "contentOfCompany1": "",
      "company2": "思納捷科技",
      "jobTitleOfCompany2": "Java後端工程師",
      "contentOfCompany2": "",
      "company3": "悅慶資訊",
      "jobTitleOfCompany3": "Java後端工程師",
      "contentOfCompany3": "",
      "company4": "聰泰科技",
      "jobTitleOfCompany4": "網頁前端工程師",
      "contentOfCompany4": ""
    }
  }
}